In [1]:
import numpy as np
import pandas as pd

In [5]:
myList = [1.1,2.2,3,5,7.7,99.8]


myArray = np.array(myList)

print('array values')

print(F'Array size : {myArray.size}')

print(myArray)

array values
Array size : 6
[ 1.1  2.2  3.   5.   7.7 99.8]

In [15]:
myseries1 = pd.Series(data=myList)
print(myseries1)
print()
myseries2 = pd.Series(myArray)
print(myseries2)

##access by index

print(myseries1[1])
print(myseries2[2])

0     1.1
1     2.2
2     3.0
3     5.0
4     7.7
5    99.8
dtype: float64

0     1.1
1     2.2
2     3.0
3     5.0
4     7.7
5    99.8
dtype: float64
2.2
3.0

In [19]:
# Creating data with labels

myLabels = ['first', 'second','third','fourth','fifth','sixth']

myseries3 = pd.Series(data=myList,index=myLabels)

print('printing series data with custom lable index')


print(myseries3)

printing series data with custom lable index
first      1.1
second     2.2
third      3.0
fourth     5.0
fifth      7.7
sixth     99.8
dtype: float64
2.2

In [21]:
#math on series 

myseries5 = pd.Series([1,2,3,4,5,6],myLabels)

print(myseries5)

print('\n\nadding myseries3 and myseries5')

print(myseries5 + myseries3)

##addes perfect with index matches in 2 series 


myseries6 = pd.Series([1,2,3],['first','two','three'])

#only first index matches on series5 and sereies 6


print('myseries6')

print(myseries6)

print('\n\nadding myseries6 and myseries5')

print(myseries5 + myseries6)

first     1
second    2
third     3
fourth    4
fifth     5
sixth     6
dtype: int64


adding myseries3 and myseries5
first       2.1
second      4.2
third       6.0
fourth      9.0
fifth      12.7
sixth     105.8
dtype: float64
myseries6
first    1
two      2
three    3
dtype: int64


adding myseries6 and myseries5
fifth     NaN
first     2.0
fourth    NaN
second    NaN
sixth     NaN
third     NaN
three     NaN
two       NaN
dtype: float64

In [30]:
#Creating data frame using series

df1 = pd.concat([myseries5,myseries6],axis=1,sort=False)
df1

          0    1
first   1.0  1.0
second  2.0  NaN
third   3.0  NaN
fourth  4.0  NaN
fifth   5.0  NaN
sixth   6.0  NaN
two     NaN  2.0
three   NaN  3.0

In [32]:
##Creating data frame using numpy arrays 

df2 = pd.DataFrame(np.random.randn(5,5))

df2  # 5*5 Matrix in data frame

          0         1         2         3         4
0  0.925780  0.726878  0.291606 -2.785381 -0.079998
1 -1.036334  0.557961 -1.209279 -1.269161  0.110749
2 -0.548704 -0.383745 -1.412317  0.452026  0.456174
3  0.633511  0.241454  0.179354  1.057820  0.459170
4  0.773210  0.250704 -0.457907 -0.038240 -0.137499

In [84]:
#Data frame with custom rows and cols lables 

df3 = pd.DataFrame(np.random.randn(3,3), index=['1','2','3'],columns=['A','B','C'])

df3

          A         B         C
1 -0.887962  1.363628 -0.748365
2 -0.113811  1.788013 -2.425627
3  2.022490  0.239314  0.172440

In [40]:
##accessing data in data frames

#df3 = pd.DataFrame(np.random.randn(3,3), index=[1,2,3],columns=['A','B','C'])

print('get coloumn b')

print(df3['B'])

get coloumn b
1    0.857222
2   -1.504707
3    2.143791
Name: B, dtype: float64

In [41]:
##get multiple values 
print(df3[['B','C']])

          B         C
1  0.857222  0.534435
2 -1.504707 -0.954005
3  2.143791  0.128379

In [49]:
## accessing rows by label
print(df3.loc['1'])

## accessing rows by index
print(df3.iloc[0])

A   -1.945557
B    2.491458
C    1.466741
Name: 1, dtype: float64
A   -1.945557
B    2.491458
C    1.466741
Name: 1, dtype: float64

In [53]:
#get certain rows and columns

df3.loc[['2','1'], ['C','A']]

          C         A
2  0.442804 -2.214126
1  1.466741 -1.945557

In [54]:
# logical indexing

df3>0

       A      B     C
1  False   True  True
2  False  False  True
3  False  False  True

In [55]:
##get subset in data frame using condtions

df3[df3>0]

    A         B         C
1 NaN  2.491458  1.466741
2 NaN       NaN  0.442804
3 NaN       NaN  1.214173

In [73]:
#adding new columns to data frame 

df3['D'] = np.random.randn(3,1)

df3

          A         B         C         D
1 -0.896342 -0.641822  0.867277  0.090064
2  0.335434  0.523883  0.361317  0.086161
3  0.323686 -1.974781 -0.926604 -1.336966

In [75]:
#delete columns from data frame 
df3.drop('D',axis=1)

          A         B         C
1 -0.896342 -0.641822  0.867277
2  0.335434  0.523883  0.361317
3  0.323686 -1.974781 -0.926604

In [71]:
#delete rows from data frame 
df3.drop('1',axis=0)

          A         B         C
2  0.335434  0.523883  0.361317
3  0.323686 -1.974781 -0.926604

In [69]:
df3

          A         B         C
1 -0.896342 -0.641822  0.867277
2  0.335434  0.523883  0.361317
3  0.323686 -1.974781 -0.926604

In [81]:
##reset index

df3.reset_index()

ValueError: cannot insert level_0, already exists

In [82]:
#df3.reset_index(inplace=True)
df3

   level_0 index         A         B         C         D
0        0     1 -0.896342 -0.641822  0.867277  0.090064
1        1     2  0.335434  0.523883  0.361317  0.086161
2        2     3  0.323686 -1.974781 -0.926604 -1.336966

In [89]:
#assign new name to index 

df3['new_name'] = ['One','Two','Three']
df3

                 A         B         C new_name
new_name
One      -0.887962  1.363628 -0.748365      One
Two      -0.113811  1.788013 -2.425627      Two
Three     2.022490  0.239314  0.172440    Three

In [90]:
## set index with inplace 

df3.set_index('new_name',inplace=True)
df3

                 A         B         C
new_name
One      -0.887962  1.363628 -0.748365
Two      -0.113811  1.788013 -2.425627
Three     2.022490  0.239314  0.172440

In [ ]:
#Combine Dataframes